Tekla Open API Reference for Tekla Structures 2025
Assembly.Add Method (IAssemblable)
 Adds the given assemblable instance to the assembly. Notice that adding other than assembly instances will assume that you are adding objects to a cast unit assembly.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Add(
	IAssemblable Object
)
Public Function Add (
	Object As IAssemblable
) As Boolean
Parameters
Object
Type: Tekla.Structures.Model.IAssemblable
The part instance to add to the assembly.
Return Value
Type: Boolean
True on success, otherwise false.
See Also
Reference
Assembly Class
Add Overload
Tekla.Structures.Model Namespace